{"pageProps":{"postData":{"id":"back-again","href":{"pathname":"/blog/[year]/[month]/[day]/[slug]","query":{"year":"2024","month":"09","day":"27","slug":"back-again"}},"contentHtml":"<p>Oh hey. It&#39;s been a while. Maybe too long, I guess. 6 years? Really?</p>\n<p>Wow.</p>\n<p>Hard to believe we&#39;re 10 years old<sup><a id=\"footnote-ref-1\" href=\"#footnote-1\" data-footnote-ref aria-describedby=\"footnote-label\">1</a></sup>. That&#39;s double digits. I remember turning double digits (in real life); it was made out to be a big deal.</p>\n<p>If you care, let me catch you up on what&#39;s happened. We didn&#39;t go quiet for no reason --- in fact, the narrative of why we stopped posting to this blog is pretty straightforward: we made a classic small-business blunder, and we over indexed on a single client. We put <del>all</del> 83% of our eggs in one basket, and then all of a sudden, that basket got yanked. What ensued was probably predictable: we tried (and failed) to find new clients, we tried (and failed) to generate revenue with side projects. We went through layoffs. We got small. We got quiet. We survived.</p>\n<p>And mostly, we turned it around. We did find new clients. We worked on cool new projects. We hired back some of those people we&#39;d had to lay off. We hired new people too. Along with the rest of the world, we weathered a pandemic, and mostly, we&#39;ve kept going.</p>\n<p>So why am I writing here again?</p>\n<p>Well, while we were working, we passed that milestone I mentioned earlier, and it&#39;s made us think a lot. About our work, our lives, our commitment to the project of sustainable creative work. We&#39;ve been talking a lot about what we want out of the next 10 years --- what does Apsis look like in 2034? Does it look like anything?</p>\n<p>We hope the answer is yes: but we sincerely don&#39;t know. We don&#39;t know, because a lot like writing code, running a team --- running a business --- is a creative endeavor. Creative, as in creating something that wasn&#39;t here yesterday. We think tomorrow we&#39;ll wake up and the spark will be there, but it&#39;s impossible to know. All we know is it was here today.</p>\n<hr>\n<section class=\"footnotes\" data-footnotes>\n<h2 id=\"footnote-label\" class=\"sr-only\">Footnotes</h2>\n<ol>\n<li id=\"footnote-1\">\n<p>10 years old as of 7 months ago. <a href=\"#footnote-ref-1\" data-footnote-backref aria-label=\"Back to reference 1\">↩</a></p>\n</li>\n</ol>\n</section>\n","layout":"post","author":"wyatt","title":"... and we're back","image":"/img/posts/crows.png","excerpt":"<p>Oh hey. It&#39;s been a while. Maybe too long, I guess. 6 years? Really?</p>\n<p>Wow.</p>\n<p>Hard to believe we&#39;re 10 years old[^1]</p>\n","date":"2024-09-24"}},"__N_SSG":true}