{"pageProps":{"postData":{"id":"the-books-i-kept","href":{"pathname":"/blog/[year]/[month]/[day]/[slug]","query":{"year":"2016","month":"04","day":"11","slug":"the-books-i-kept"}},"person":{"name":"Wyatt Kirby","current":true,"title":"Founding Partner","image":"/img/people/wyatt.png","bio":"An accidental developer, Wyatt came to software and small business by an\nunconventional route. As a cofounder at Apsis, he has helped build a team of\nexceptional engineers, one equipped to deliver effective solutions fast.\nAfter more than a decade, Wyatt _keeps_ coming back to software because it\noffers a rare convergence of interests: writing, teaching, and tech.\nA graduate of Bennington College in Vermont, Wyatt's appreciation for clear\ncommunication has come to define Apsis's engineering team: understanding first,\ntechnology second. This focus leads to asking the right questions, finding the\nright answers, and delivering success year after year.\n\n\nAfter work, you'll find Wyatt enjoying time with his wife and daughter, playing\nwith the cat, roasting coffee, cooking dinner, or arguing on the internet about\ncollege football.\n","bio_short":"An accidental developer turned entrepreneur, Wyatt has helped build a team of exceptional\nengineers at Apsis. After a decade in the field, he continues to be drawn to software for\nits blend of writing, teaching, and tech.\n"},"desc":"I studied literature at [Bennington College](http://bennington.edu/). There, I wrote my thesis on the past, present, and future of the book object. Five years later, I'm still fascinated by the subject. The role that bound paper has played not just in my life, but in the history of humankind, is&hellip;","contentHtml":"<p>I studied literature at <a href=\"http://bennington.edu/\">Bennington College</a>. There, I wrote my thesis on the past, present, and future of the book object. Five years later, I&#8217;m still fascinated by the subject. The role that bound paper has played not just in my life, but in the history of humankind, is staggering. Men and women have died for books; we&#8217;ve burned them, banned them, mass manufactured and hand crafted them; we keep them like pets, we lend them and lose them, and some we revisit again and again &#8212; staining their pages, breaking their spines.</p>\n<p>This weekend I decided to get rid of my books. Not all of them, but some of them. I realized that, between my Kindle, my iPad, my phone, my computer, and the public library, I didn&#8217;t need to own as many pages as were filling my shelves. I settled on a number: 100. It was tough, but deciding on which stories mattered enough to live with was an interesting exercise.</p>\n<p>These are the books I kept, and (for some) why I kept them.</p>\n<hr>\n<ol>\n<li><strong>Adams, Douglas. <em>The Ultimate Hitchhiker&#8217;s Guide</em>.</strong></li>\n<li><strong>Alexander, Lloyd. <em>Time Cat</em>.</strong> One of my most cherished childhood books, Alexander is better known for <em>Chronicles of Prydain</em>. I&#8217;ve kept this for my children, even though they don&#8217;t exist yet.</li>\n<li><strong>Alighieri, Dante. <em>The Divine Comedy</em>.</strong> I own three translations of Dante: Allen Mandelbaum, Carlyle Wicksteed, and Dorothy Sayers. Translations have always interested me, and I feel that a lot of creative work is, at its core, translation: whether it&#8217;s Italian to English or comps to code, we&#8217;re all involved in reinterpreting the world around us.</li>\n<li><strong>Amis, Kingsley. <em>The King&#8217;s English: A Guide to Modern Usage</em>.</strong> Kingsley Amis, like Oscar Wilde before him, was too clever for his own good. This guide to the English language is entertaining and illuminating.</li>\n<li><strong>Aristotle. <em>The Nicomachean Ethics</em>.</strong> One of the most interesting words in the English language is &#8220;happiness.&#8221; Enshrined as a fundamental human right by the Declaration of Independence, the shifting idea of happiness, and its origins, make for an interesting study. Derived from the word <em>hap</em>, a word for chance or luck, <em>happiness</em> shares its roots with <em>happen</em>, <em>mishap</em>, and <em>perhaps</em>. Aristotle&#8217;s views on ethics are worth reading in their entirety, but he begins with a definition of <em>happiness</em>, and how it relates to the study of ethics.</li>\n<li><strong>Aasimov, Isaac. <em>Foundation</em>.</strong> A classic, the first is arguably the best in the series.</li>\n<li><strong>Aurelius, Marcus. <em>Meditations</em>.</strong> Sometimes I consider this to be the most important book I own; I wish this book were more widely taught to younger students.</li>\n<li><strong>Banville, John. <em>The Untouchable</em>.</strong> Well composed, beautiful, a fascinating retelling of the true story of the Cambridge Spies. Also an interesting entry in the saga of the English spy novel &#8212; a particular interest of mine.</li>\n<li><strong>Beckett, Samuel. <em>I Can&#8217;t Go On, I&#8217;ll Go On: A Samuel Beckett Reader</em>.</strong> I find Beckett inspiring; possibly the only author who could do a convincing rendition of James Joyce, but chose instead to pioneer essentially the opposite. Like Picasso, his work is much more interesting when you understand the underlying choices &#8212; he writes the way he does not from a limited vocabulary or lack of skill, but from an explicit exploration of the boundaries of storytelling.</li>\n<li><strong>Birkerts, Sven. <em>The Gutenberg Elegies</em>.</strong> I had the pleasure of eating dinner with Mr. Birkerts once, and he is as interesting in person as he is in this collection of essays. I would consider this essential reading for anyone who works in tech.</li>\n<li><strong>Bowen, Elizabeth. <em>Death of the Heart</em>.</strong></li>\n<li><strong>Bowen, Elizabeth. <em>To the North</em>.</strong></li>\n<li><strong>Bowen, Elizabeth. <em>The Heat of the Day</em>.</strong></li>\n<li><strong>Bowen, Elizabeth. <em>The Last September</em>.</strong> Bowen&#8217;s work is remarkable. Subtle, thrilling, and still relevant. If you enjoy <em>Downton Abbey</em>, you will be floored by the world Bowen illustrates.</li>\n<li><strong>Bryson, Bill. <em>Shakespeare: The World as Stage</em>.</strong> A reminder that we know less than we think.</li>\n<li><strong>Bryson, Bill. <em>Notes from a Small Island</em>.</strong></li>\n<li><strong>Bryson, Bill. <em>The Mother Tongue: English and How it Got That Way</em>.</strong> The History of the English Language is one of the most intriguing subjects I&#8217;ve ever studied, and Bryson does a commendable job in laying out the broad strokes of the subject.</li>\n<li><strong>Calvino, Italo. <em>The Castle of Crossed Destinies</em>.</strong> There is no writer like Calvino, and while <em>The Castle of Crossed Destinies</em> is not his best known (or even his best) work, its structure is an interesting look at the construction of a novel. I think of it, sometimes, like an experienced object-oriented programmer being introduced to functional paradigms for the first time.</li>\n<li><strong>Card, Orson Scott. <em>Ender&#8217;s Game</em>.</strong></li>\n<li><strong>Carver, Raymond. <em>Collected Stories</em>.</strong> It&#8217;s tempting to list Gordon Lish (Carver&#8217;s editor) as the author of these works; I read Carver not just for his own work, but because it is the product of a masterful &#8212; if unethical &#8212; editor.</li>\n<li><strong>Cervantes, Miguel de. <em>Don Quixote</em>.</strong></li>\n<li><strong>Chartier, Roger. <em>The Order of Books</em>.</strong> An examination of the systems around organizing a universal library. Relevant to anyone working with or thinking on the impact of the internet on human culture.</li>\n<li><strong>Chekhov, Anton. <em>Short Stories</em>.</strong> There is perhaps no one more masterful in the art of short story writing than Chekhov. Anyone interested in the art of observation, or the small details that define human life, will learn much from his work.</li>\n<li><strong>Childers, Erskine. <em>The Riddle of the Sands</em>.</strong> It may be apocryphal, but I&#8217;ve heard that <em>The Riddle of the Sands</em> was required reading in the British navy. Another example of the English spy, Childers work offers insight into international relations preceding the first world war.</li>\n<li><strong>Clarke, Arthur C. <em>Childhood&#8217;s End</em>.</strong></li>\n<li><strong>Clarke, Arthur C. <em>The Fountains of Paradise</em>.</strong> One of the things that intrigues me about science fiction is how it addresses the seminal role of literature: to explore and interpret the human condition. The birth of popular science fiction in the nineteenth century<sup><a id=\"footnote-ref-1\" href=\"#footnote-1\" data-footnote-ref aria-describedby=\"footnote-label\">1</a></sup>, to me, coincides with an exhaustion of the English novel: the same stories had been written and re-written for over a century, and authors like Mark Twain, Jules Verne, and H.G. Wells were searching for new and interesting lenses to examine what it meant to be human. Science Fiction, when written well, places believable characters in fantastical situations to view the human condition in ways made impossible by the restrictions of the real world. Clarke is a master of this art, and these two novels, taken together, are my favorite of his work.</li>\n<li><strong>Conrad, Joseph. <em>The Secret Agent</em>.</strong></li>\n<li><strong>Davis, Joel. <em>The Mother Tongue</em>.</strong></li>\n<li><strong>Defoe, Daniel. <em>A Journal of the Plague Year</em>.</strong> I enjoy Defoe not simply because he writes well, but because his work lays the groundwork of the English novel. <em>Plague Year</em> is part primary historical document, part novel, and entertaining, to boot.</li>\n<li><strong>Diamond, Jared. <em>Collapse</em>.</strong> Diamond is, like Sagan, is a popular figure for a complicated subject. While he tends to assert truth with infirm evidence, his work is more accessible than more rigorous books, and for the casual social scientist, more than adequate. <em>Collapse</em> is a fascinating look at how societies face unintended consequences, and draws parallels between modern climate change and the fall of some pre-agrarian societies.</li>\n<li><strong>Dick, Philip K. <em>Do Androids Dream of Electric Sheep</em>.</strong> One of the rare cases where the movie, in some respects, improves upon the book. Nevertheless, Dick is an excellent author, and, in the same respect as Clarke, very capable of parsing the curiosities of human nature in new and exciting circumstances.</li>\n<li><strong>Dickens, Charles. <em>Bleak House</em>.</strong></li>\n<li><strong>Dickens, Charles. <em>David Copperfield</em>.</strong></li>\n<li><strong>Dickens, Charles. <em>Great Expectations</em>.</strong> This trio of Dickens&#8217; work are his three novels written from the first person, and, in many respects, I believe to be hist finest. <em>Bleak House</em>, in particular, is a small miracle of a novel.</li>\n<li><strong>Dostoevsky, Fyodor. <em>The Brothers Karamozov</em>.</strong> I have started this book a dozen times, and each time I have put it down, knowing that I am not a talented enough reader to do the book justice. Such are the Russians. I will finish this someday, once I have had more practice.</li>\n<li><strong>Duane, Diane. <em>So You Want to be a Wizard</em>.</strong> Harry Potter before Harry Potter, now criminally under-read.</li>\n<li><strong>Eisenstein, Elizabeth. <em>The Printing Revolution of Early Modern Europe</em>.</strong> It&#8217;s hard to overstate how important the advent of the printing press was to the western world. Eisenstein does a good job of capturing a broad view of the monumental changes to every facet of life resulting from Gutenberg&#8217;s work.</li>\n<li><strong>Farmer, Philip José. <em>To Your Scattered Bodies Go</em>.</strong> Every human who has ever lived, a river with no end, Richard Francis Burton. What else do you want?</li>\n<li><strong>Faulkner, William. <em>The Sound and the Fury</em>.</strong> A challenging, but rewarding, read. Do yourself a favor and read it twice.</li>\n<li><strong>Fielding, Henry. <em>The History of Tom Jones, a Foundling</em>.</strong> I firmly believe that if just half the world had read <em>Tom Jones</em>, we would be significantly better off as a species. Fielding presents, in a single work, not just an entertaining novel that dispels any myths of 18th century prudishness, but also a series of essays on the art of writing that are themselves a masterclass in composition.</li>\n<li><strong>Flaubert, Gustave. Translated by Francis Steegmuller. <em>Madame Bovary</em>.</strong> A visceral indictment of French society, Flaubert&#8217;s masterpiece is a shining example of fiction&#8217;s ability to effect change. Steegmuller&#8217;s translation is, to my mind, the definitive version; if you&#8217;ve read <em>Madame Bovary</em> before, but in a different translation, you&#8217;re in for a treat.</li>\n<li><strong>Forster, E.M. <em>Aspects of the Novel</em>.</strong> Compiled from a series of lectures delivered at Cambridge, Forster&#8217;s <em>Aspects of the Novel</em> is a roadmap to understanding something as ill defined as the novel. Drawing on classics and contemporaries, Forster navigates murky waters to lay out 7 defining elements of the novel: story, people, plot, fantasy, prophecy, pattern, and rhythm.</li>\n<li><strong>Forster, E.M. <em>Howards End</em>.</strong></li>\n<li><strong>Gallant, Mavis. <em>Paris Stories</em>.</strong></li>\n<li><strong>Garner, Bryan A. <em>Garner&#8217;s Modern American Usage</em>.</strong> The only reference to English usage your library needs.</li>\n<li><strong>Greene, Graham. <em>The Quiet American</em>.</strong></li>\n<li><strong>Greene, Graham. <em>The Ministry of Fear</em>.</strong> Greene&#8217;s fiction is exemplary in its ability to bring the thriller to high literary standards. I am embarrassed for James Patterson and his ilk every time I pick up one of Greene&#8217;s books.</li>\n<li><strong>Haldeman, Joe. <em>The Forever War</em>.</strong> The anguish of Vietnam distilled through science fiction; still relevant today as the definition of modern warfare changes.</li>\n<li><strong>Hardy, Thomas. <em>Jude the Obscure</em>.</strong></li>\n<li><strong>Hazard, Shirley. <em>Cliffs of Fall</em>.</strong></li>\n<li><strong>Heinlein, Robert A. <em>To the Stars</em>.</strong></li>\n<li><strong>Heinlein, Robert A. <em>Starship Troopers</em>.</strong></li>\n<li><strong>Heinlein, Robert A. <em>Stranger in a Strange Land</em>.</strong> Heinlein is a curiosity to me. He walks a fine line between satire and seriousness which makes his work thrilling. A novel which generates as much division and discussion as <em>Starship Troopers</em> is not only worth reading, but worth rereading.</li>\n<li><strong>Heller, Joseph. <em>Catch-22</em>.</strong> The most complete novel written since the end of World War II.</li>\n<li><strong>Hemingway, Ernest. <em>A Farewell to Arms</em>.</strong></li>\n<li><strong>Hemingway, Ernest. <em>The Old Man and the Sea</em>.</strong></li>\n<li><strong>Herbert, Frank. <em>Dune</em>.</strong></li>\n<li><strong>Hertnon, Simon. <em>Endangered Words</em>.</strong></li>\n<li><strong>Hitchings, Henry. <em>The Secret Life of Words</em>.</strong></li>\n<li><strong>Hofstadter, Douglas. <em>I am a Strange Loop</em>.</strong></li>\n<li><strong>Homer. Translated by Richmond Lattimore. <em>The Odyssey</em>.</strong> I was raised on Odysseus; to me <em>The Odyssey</em> is more bedtime story than anything else, but its actual rendition is an engaging read, and an important point of reference for the study of English literature.</li>\n<li><strong>Jacques, Brian. <em>Redwall</em>.</strong></li>\n<li><strong>James, Henry. <em>The Ambassadors</em>.</strong> The opening chapter of <em>The Ambassadors</em> may be the most well constructed piece of writing I&#8217;ve ever encountered. James&#8217; work is challenging, but rewarding.</li>\n<li><strong>Jordan, Robert. <em>Winters Heart</em>.</strong> This is a first edition copy of a book that is, by all objective measures, not good. The entire series, for that matter, is not good. But this was one of the first novels I bought with my own money, and I spent roughly half my life waiting for the story of Rand al&#8217;Thor to draw to a close.</li>\n<li><strong>Joyce, James. <em>Dubliners</em>.</strong></li>\n<li><strong>Kacirk, Jeffrey. <em>Forgotten English</em>.</strong></li>\n<li><strong>Kafka, Franz. <em>The Complete Stories</em>.</strong></li>\n<li><strong>Kafka, Franz. <em>The Trial</em>.</strong></li>\n<li><strong>Kafka, Franz. <em>The Castle</em>.</strong></li>\n<li><strong>Kermode, Frank. <em>Concerning E.M. Forster</em>.</strong> Delivered in the same lecture series as <em>Aspects of the Novel</em>, I disagree with much of Kermode&#8217;s assessment of Forster&#8217;s impact<sup><a id=\"footnote-ref-2\" href=\"#footnote-2\" data-footnote-ref aria-describedby=\"footnote-label\">2</a></sup>, but respect his work.</li>\n<li><strong>Krauss, Nicole. <em>Great House</em>.</strong> Not her best novel, but certainly compelling. Krauss is one of my favorite authors writing today.</li>\n<li><strong>L&#8217;Engle, Madeleine. <em>A Wrinkle in Time</em>.</strong></li>\n<li><strong>Le Carré, John. <em>The Spy Who Came in from the Cold</em>.</strong> Le Carré&#8217;s best.</li>\n<li><strong>Lederrer, Richard. <em>Anguished English</em>.</strong></li>\n<li><strong>Leguin, Ursula K. <em>The Left Hand of Darkness</em>.</strong></li>\n<li><strong>Leonard, Elmore. <em>Glitz</em>.</strong> Graham Greene&#8217;s successor, no one writes crime like Leonard.</li>\n<li><strong>Levitt, Steven, and Stephen Dubner. <em>Freakonomics</em>.</strong></li>\n<li><strong>Lowry, Lois. <em>The Giver</em>.</strong></li>\n<li><strong>Machiavelli, Nicolo. <em>The Prince and The Discourses</em>.</strong></li>\n<li><strong>Madden, Matt. <em>99 Ways to Tell a Story</em>.</strong> A graphic novel that retells the same sequence of events in 99 different ways. Most interesting as an exploration of structure, and relevant in far more fields than storytelling alone.</li>\n<li><strong>Marquez, Gabriel Garcia. <em>One Hundred Years of Solitude</em>.</strong></li>\n<li><strong>Maugham, W. Somerset. <em>Collected Short Stories, Volume 3</em>.</strong> Ashenden is my favorite British spy (sorry, Bond). I&#8217;m hopeful that someone will do justice with a modern film adaptation (the last was done in 1991), but simultaneously terrified that it will be a Michael Bay film.</li>\n<li><strong>Maxwell, William. <em>They Came Like Swallows</em>.</strong></li>\n<li><strong>Maxwell, William. <em>Time Will Darken It</em>.</strong></li>\n<li><strong>Maxwell, William. <em>Billie Dyer</em>.</strong></li>\n<li><strong>Maxwell, William. <em>All the Days and the Nights</em>.</strong> A collection of Maxwell&#8217;s short stories, each its own masterpiece. The long time fiction editor at <em>The New Yorker</em>, you&#8217;ve probably already read Maxwell&#8217;s work without realizing it. I see the craft of his editing in conversation with that of Gordon Lish (Raymond Carver&#8217;s judicious editor), in how their opposing strategies drew the best from their authors&#8217; work.</li>\n<li><strong>Maxwell, William. <em>So Long, See You Tomorrow</em>.</strong> You can read this book in a single sitting, but do so at your own risk: its rare that so few pages can so deliver so forceful an emotional impact. A perfect gem of a novella.</li>\n<li><strong>Muller, Walter M., Jr. <em>A Canticle for Liebowitz</em>.</strong> For anyone who doubts that science fiction can be profound, this novel is unassailable evidence to the contrary.</li>\n<li><strong>Nabokov, Vladimir. <em>The Defense</em>.</strong> Not his best known work, but <em>The Defense</em> is one of Nabokov&#8217;s most enjoyable.</li>\n<li><strong>Niven, Larry. <em>Ringworld</em>.</strong></li>\n<li><strong>Pahlaniuk, Chuck. <em>Survivor</em>.</strong> The only Pahlaniuk novel I can bring myself to reread.</li>\n<li><strong>Poe, Edgar Allan. <em>The Complete Stories</em>.</strong></li>\n<li><strong>Powell, Anthony. <em>A Dance to the Music of Time, Volumes 1-12</em>.</strong> I sometimes miss novels. I miss spending time with Don Quixote, and I miss Yossarian. That is the effect that Powell&#8217;s epic has on me: it makes me miss a Great Britain that never existed, and a set of people I&#8217;ve never known.</li>\n<li><strong>Powell, Anthony. <em>Afternoon Men</em>.</strong> Long out of print, this small novel, written when Powell was just 26 years old, is perhaps more poignant today than when it was written almost a century ago.</li>\n<li><strong>Salinger, J.D. <em>Nine Stories</em>.</strong></li>\n<li><strong>Sterne, Laurence. <em>Tristram Shandy</em>.</strong> For any author writing in an innovative structure or style, it&#8217;s more likely than not that Sterne accomplished it in <em>Tristram Shandy</em> back in 1759.</li>\n<li><strong>Szymborska, Wislawa. <em>View with a Grain of Sand</em>.</strong> The only book of poetry I&#8217;ve kept, which says more about me than it does about poetry.</li>\n<li><strong>Talese, Gay. <em>A Writer&#8217;s Life</em>.</strong></li>\n<li><strong>Vonnegut, Kurt. <em>The Sirens of Titan</em>.</strong> My second favorite <em>Vonnegut</em>.</li>\n<li><strong>Wodehouse, P.G. <em>Uncle Dynamite</em>.</strong> When it comes to the English literary canon, the name I find most frequently missing is that of Mr. Wodehouse. Uncle Fred feels like falling off a cliff, only to be saved at the last moment in the most pleasant way possible.</li>\n</ol>\n<hr>\n<p>When I started writing this, I was asked why the books I kept belonged on what is ostensibly a tech blog. To me, the connection between my library and my work feels self evident: perhaps as a byproduct of my education, I see every pursuit as necessarily multi-disciplinary. Software is no exception. The meat of each project we undertake at Apsis isn&#8217;t really in the code we write (though the hours, are), but in architecting and designing the best solution for any given problem. We are frequently tasked with understanding structure, and how to represent that structure to our users. While no book in my physical library is directly related to building software, what I&#8217;ve learned about telling stories has contributed more to my understanding of application design than anything else.</p>\n<p>This process has also shown clear trends in the books I care to make a part of my life: books I studied in college, science fiction, and books on the English language. I&#8217;ll be curious to revisit this process again in ten years, to see what has changed, and what hasn&#8217;t.</p>\n<section class=\"footnotes\" data-footnotes>\n<h2 id=\"footnote-label\" class=\"sr-only\">Footnotes</h2>\n<ol>\n<li id=\"footnote-1\">\n<p>We can argue about the exact date some other time. <a href=\"#footnote-ref-1\" data-footnote-backref aria-label=\"Back to reference 1\">↩</a></p>\n</li>\n<li id=\"footnote-2\">\n<p>I wrote, once:</p>\n<blockquote>\n<p>So what, in the end, has Kermode accomplished? I am tempted, as a defender of Forster and now an opponent of Kermode&#8217;s to say that he has accomplished nothing, that the entire expanse of this section of his book is worth less than the paper on which it is printed. I am tempted, but to do so would be unfair, not just to Kermode&#8217;s reputation, but to the work itself. For, though I do not see it as giving much to Aspects, or to Forster, what it does is give us telling insight into an important man in literature&#8217;s history.</p>\n<p>In the end, we are left with an image of Forster, standing with one foot in the past, and one foot placed hesitantly in the future. He is appreciative of few, the aesthetic heir of an ended century. He knows what is good as well as what he likes, but often allows the latter to interfere with his perception of the former; he is disagreeable but eloquent, witty, capable, brilliant, and fatally flawed. He does not, as Trilling once said, refuse to be great, but was, it seems to me, born just a moment too late.</p>\n</blockquote> <a href=\"#footnote-ref-2\" data-footnote-backref aria-label=\"Back to reference 2\">↩</a>\n</li>\n</ol>\n</section>\n","layout":"post","author":"wyatt","title":"The Books I Kept","image":"/img/posts/books.jpg","credit":"Patrick Tomasso","date":"2016-04-11","excerpt":"<p>I studied literature at <a href=\"http://bennington.edu/\">Bennington College</a>. There, I wrote my thesis on the past, present, and future of the book object. Five years later, I&#8217;m still fascinated by the subject. The role that bound paper has played not just in my life, but in the history of humankind, is&hellip;</p>\n"},"cta":{"title":"What does success look like for you?","subtitle":"We can make it happen.","button":"Let's talk"}},"__N_SSG":true}