{"pageProps":{"team":{"noah":{"name":"Noah Callaway","current":true,"title":"Founding Partner","image":"/img/people/noah.jpg","bio":"For over 10 years, Noah has been the technical backbone of the Apsis\nengineering team. In stark contrast to his cofounder, Noah's history is\nabout as textbook as it gets: CS classes at the University of Oregon while\nstill in high school, BS from the University of Washington with\nspecialization in physics and computer science, a stint at Microsoft, a tour\nat Amazon, and for the last decade plus, serving as Apsis's lead engineer\nand architect. Noah's drive for building the technically correct solution is\nbalanced by his decade of experience running Apsis Labs, where his focus is on\noutcome-driven-development: finding the solution that delivers 90% of the value\nat 10% of the effort.\n\n\nOutside of work, you'll find Noah with his wife, dog, and two young children;\nor you'll find him working, but this time on a new GUI layout engine in Rust or\nperhaps trying to get his video drivers to work correctly &mdash; he runs Linux after\nall.\n","bio_short":"For over a decade, Noah has led Apsis' engineering team with technical expertise.\nHis background is textbook: CS degree from UW, time at Microsoft and Amazon, and\nnow 10+ years as Apsis' lead engineer and architect.\n","social":[{"network":"linkedin","link":"https://www.linkedin.com/in/noah-callaway-166137b/"},{"network":"blog","link":"/blog/people/noah"},{"network":"github","link":"https://github.com/ncallaway"}]},"wyatt":{"name":"Wyatt Kirby","current":true,"title":"Founding Partner","image":"/img/people/wyatt.jpg","bio":"An accidental developer, Wyatt came to software and small business by an\nunconventional route. As a cofounder at Apsis, he has helped build a team of\nexceptional engineers, one equipped to deliver effective solutions fast.\nAfter more than a decade, Wyatt _keeps_ coming back to software because it\noffers a rare convergence of interests: writing, teaching, and tech.\nA graduate of Bennington College in Vermont, Wyatt's appreciation for clear\ncommunication has come to define Apsis's engineering team: understanding first,\ntechnology second. This focus leads to asking the right questions, finding the\nright answers, and delivering success year after year.\n\n\nAfter work, you'll find Wyatt enjoying time with his wife and daughter, playing\nwith the cat, roasting coffee, cooking dinner, or arguing on the internet about\ncollege football.\n","bio_short":"An accidental developer turned entrepreneur, Wyatt has helped build a team of exceptional\nengineers at Apsis. After a decade in the field, he continues to be drawn to software for\nits blend of writing, teaching, and tech.\n","social":[{"network":"linkedin","link":"https://www.linkedin.com/in/wyatt-kirby-b5a26726"},{"network":"blog","link":"/blog/people/wyatt"},{"network":"github","link":"https://github.com/wkirby"},{"network":"bluesky","link":"https://bsky.app/profile/wyattkirby.com"}]},"eric":{"name":"Eric Greer","current":true,"title":"Senior Engineer & Devops Specialist","image":"/img/people/eric.jpg","bio":"Eric is a full stack software developer with a passion for DevOps. Working\nwith the nuances of AWS, he has worked move large clients and small into the\ncloud architecture that is right for them, automating deployments and\nensuring applications stability. Eric has a B.S and M.S. in Computer Science\nfrom WPI, a background in IT support, combined with 15 years of software\ndevelopment projects which gives him an attention to detail and makes him a\ngo to resource for any questions a client may have. Eric finds passion\nlearning the nuances of each business and is always excited to tackle the\nnext challenging project.\n","bio_short":"A full-stack developer with 15 years of experience and a passion for DevOps\n Eric has helped numerous clients navigate the cloud with AWS. Always eager for the next challenge,\n he loves learning each business's nuances and delivering stability\n through automation.\n","social":[{"network":"linkedin","link":"https://www.linkedin.com/in/greereric/"},{"network":"blog","link":"/blog/people/eric"},{"network":"github","link":"https://github.com/egreer"}]},"henry":{"name":"Henry Keiter","current":true,"title":"Senior Engineer & 1400 ELO","image":"/img/people/henry.jpg","bio":"Henry is an imported Coloradan who views software development as a window\ninto everyone else's fields. Every industry has fascinating hurdles that are\ncompletely unknown to the outside world, and software allows us to build a catapult\nto hurl ourselves over them, if we take the time to map the terrain first.\nLearning the landscape from domain experts is always a rich experience.\nDelivering a catapult that meets their actual needs is a fitting reward.\n\n\nBeyond the office, you'll find Henry reading, gardening, or playing strategy\ngames with family. Any physical catapults in the backyard are strictly\ncoincidental.\n","bio_short":"An imported Coloradan, Henry sees software as a tool to bridge industries.\nHe loves collaborating with domain experts to map the terrain, then building\nsolutions that meet their real-world needs.\n","social":[{"network":"linkedin","link":"https://www.linkedin.com/in/henrykeiter/"},{"network":"blog","link":"/blog/people/henry"},{"network":"github","link":"https://github.com/henrykeiter"}]},"chris":{"name":"Chris Pfohl","current":true,"title":"Senior Engineer & Data Engineer","image":"/img/people/chris.jpg","bio":"Chris is an expert data mover, munger, and analyzer. He builds robust third\nparty integrations, answers tough questions with data, and brings order to\ndatabases and applications to empower new features and higher reliability.\n\n\nChris loves to share his expertise with newer developers through code\nreview, teaching, and good documentation. He also loves writing code that's\nhard to use wrong and creating tools that empower his team to deliver faster\nand more reliably. He was drawn to programming, and contract work in\nparticular because of his deep love of learning, solving problems, and\nsharing that knowledge.\n","bio_short":"A master data mover and analyzer, Chris crafts robust integrations and sorts\nthrough complexity with ease. He loves sharing his expertise through code review,\nteaching, and rock-solid documentation.\n","social":[{"network":"linkedin","link":"https://www.linkedin.com/in/chrispfohl/"},{"network":"blog","link":"/blog/people/chris"},{"network":"github","link":"https://github.com/Crisfole"}]},"matt":{"name":"Matt Erhart","current":true,"title":"Senior Engineer & Farmhand","image":"/img/people/matt.jpg","bio":"Matt is a longtime Senior Software Engineer, fledgling farmer and\nenthusiastic problem solver. Up or down the stack, from infrastructure to\nplanning meetings, Matt calls on nearly 2 decades of development experience\nto help deliver client visions. With a B.S. in Pure Mathematics and an\nunquenchable desire for getting lost in the woods, you'll find Matt either\npondering the inner workings of the universe perched in a bus window,\nhappily trying to relocate the trail in the backcountry of the PNW or neck\ndeep in code to help figure out why that _one_ server keeps crashing.\n","bio_short":"A seasoned Senior Software Engineer and enthusiastic problem solver, Matt\ncombines nearly 2 decades of dev experience with a pure mathematician's mind.\nWhen not coding, you'll find him on the farm &mdash; his true passion.\n","social":[{"network":"linkedin","link":"https://www.linkedin.com/in/matthewerhart/"},{"network":"blog","link":"/blog/people/matt"},{"network":"github","link":"https://github.com/matterhart"}]},"joey":{"name":"Joey Harwood","current":true,"title":"Senior Engineer & Big Data Specialist","image":"/img/people/joey.jpg","bio":"Joey is a lifelong problem solver. He fell in love with math at a young age\nand eventually found his way to programming as an even more intriguing\npuzzle. A graduate of Colby College with a B.A. in Computer Science, his\ncareer started building Android applications. He moved onto designing\nand optimizing big data tables housing terabytes of data, minimizing query\ncosts while answering complex business questions using statistical analysis.\n\n\nOutside of work you’ll often find Joey exploring new strategies to\nexcel in local pinball tournaments or lost down a rabbit hole of\nYouTube videos taking a deep dive into the wonders of the cosmos. Just as\nlikely, he is with his wife wrestling, chasing, training, or otherwise\nspending time with their two dogs.\n","bio_short":"With a background in Android development and big data, Joey has found a way\nto turn his love of math and puzzles into a career in software development.\nWhen not at work, he's most likely found at a pinball table.\n","social":[{"network":"linkedin","link":"https://www.linkedin.com/in/joseph-harwood-a980b9a1/"},{"network":"blog","link":"/blog/people/joey"},{"network":"github","link":"https://github.com/Joey-Harwood"}]}}},"__N_SSG":true}