{"pageProps":{"postData":{"id":"preparing-for-docker","href":{"pathname":"/blog/[year]/[month]/[day]/[slug]","query":{"year":"2017","month":"01","day":"13","slug":"preparing-for-docker"}},"contentHtml":"<p>It is a dark winter day at your desk in Maine and your boss gets back from sunny California and says \"Docker is the best, we need to start using this for everything!\". You internally groan because you just got all the infrastructure working correctly, but you start frantically searching how to setup and run Docker and jump right into figuring out how to apply it to your current projects because it needs to be done yesterday.</p>\n<p>Before looking into how to setup Docker, let's fill in the basics of what you always wanted to know about Docker but didn't know you needed to ask.</p>\n<h2>What is Docker?</h2>\n<p>Docker is a tool for developing applications in a virtualized operating system, called a container, which can run on any hardware, guaranteeing that the software runs the same in any environment.</p>\n<p>Docker containers allow you to install anything that would normally be installed on a server to run your application into a portable file that can be moved from environment to environment without any need to reinstall the dependencies.</p>\n<p>Docker is similar to Vagrant and VMWare; all three of which allow you to setup virtual infrastructure on top of physical hardware, but each one has its own degree of control. Docker containers operate on the principle that each container runs one process vs running multiple services on one VM.</p>\n<p>What about Docker Compose? Docker Compose is tool set provided by Docker for configuring, networking and deploying multiple containers for more complex application configurations.</p>\n<h2>Why Docker?</h2>\n<p>There are many reasons for choosing Docker:</p>\n<ul>\n<li>Ease of Creation - Image is defined in one file, with simple run commands</li>\n<li>Speed - Much faster than a full VM for startup ( after the initial download )</li>\n<li>Size - Although the images can inflate really quickly they are generally smaller than full VMs</li>\n<li>Consistency - The image used locally can be the same as production</li>\n<li>Reproducibility - Container configuration is a file which can be stored in version control</li>\n</ul>\n<p>Docker is very well designed for local development as it focuses on running one application in its own environment. This helps separate processes from different applications without having to setup multiple VMs.</p>\n<p>For all the various projects you may interact with, most likely there is a Docker image already preconfigured with the basic software for running your particular language ( Rails, Python, etc ) or software ( Nginx, Memcached, MySQL, etc. ) Just take a look on Docker Hub and look for the official tag for any library.</p>\n<h2>Production Concerns</h2>\n<p>As you think about moving your Docker application into production there becomes a whole host of challenges and problems you will need to solve.</p>\n<ul>\n<li>Container Hosting - Hosted vs cloud repositories like Docker Hub or Quay.io</li>\n<li>Deployment Strategies - Tools like Rancher or Kubernetes</li>\n<li>Garbage Collection - Old images fill up disk on the host</li>\n<li>Database Management - Don't run in a container!</li>\n<li>Logging - Shared mounted volume to write log to disk vs external logging service</li>\n<li>Monitoring - Performance, uptime, resource utilization, etc.</li>\n</ul>\n<p>Cloud 66 has a great article detailing these items before using Docker in production: <a href=\"http://blog.cloud66.com/9-crtitical-decisions-needed-to-run-docker-in-production/\">http://blog.cloud66.com/9-crtitical-decisions-needed-to-run-docker-in-production/</a></p>\n<h2>Tips and Tricks</h2>\n<h3>Planning the Architecture</h3>\n<p>Deciding whether Nginx in front of the Rails application or Memcached in front of the DB is the right choice for the system will help determine how to setup a Docker network. Docker Compose allows setup for networking between multiple containers, any external dependencies, volumes, and environmental variables the containers may need.</p>\n<h3>Image Size</h3>\n<p>Docker containers can grow in size very quickly, and minimizing the size helps portability. Every command run in the DockerFile creates its own container as a snapshot which helps reuse across Docker builds but increases the size significantly. To minimize the container, start by finding the minimal image that will support the software and only install the minimal software needed. The next step is to condense all the run commands into the fewest number needed.</p>\n<p>For example when installing dependencies a typical install might look like:</p>\n<div><pre><code>RUN apt-get update -qq &#x26;amp;&#x26;amp; apt-get install -y build-essential\nRUN apt-get update -qq &#x26;amp;&#x26;amp; apt-get install -y nodejs\nRUN apt-get update -qq &#x26;amp;&#x26;amp; apt-get install -y python2.7</code></pre></div>\n<p>This creates three containers. A more optimized version that only creates one container is:</p>\n<div><pre><code>RUN apt-get update -qq &#x26;amp;&#x26;amp; apt-get install -y \\\n    build-essential \\\n    nodejs \\\n    python2.7</code></pre></div>\n<p>Codeship has a great article detailing some of the optimizations for the Dockerfile: <a href=\"https://blog.codeship.com/reduce-docker-image-size/\">https://blog.codeship.com/reduce-docker-image-size/</a></p>\n<h3>Cleanup</h3>\n<p>Monitoring the host's disk space where Docker containers are deployed is crucial, especially in development environments where several versions of a Docker container may be pushed a day. The easy way to clean up is to setup a cron to run:</p>\n<div><pre><code>sudo docker images -q | xargs sudo docker rmi</code></pre></div>\n<p>Or you can run a full container to manage garbage collection for you: <a href=\"https://github.com/spotify/docker-gc\">https://github.com/spotify/docker-gc</a></p>\n<h2>Wrap up</h2>\n<p>Docker is a great technology for development environments and simpler applications, but consider carefully whether it is a good fit for your particular application's needs, especially if there is already a technology stack in place.</p>\n<p>Here at Apsis we use the technology that is right for the application and are constantly looking out for changes in best practices and supporting technologies, so I'm sure you'll hear more about our exploration with Docker in future posts.</p>\n<p><em>\"Wait, what do you mean we aren't going to use Docker anymore? I just got everything converted... Noaaahhh!!!\"</em></p>\n<h2>Resources</h2>\n<p>For everything you can do with Docker and Docker Compose it is good to check out the docs.</p>\n<p><a href=\"https://docs.docker.com\">https://docs.docker.com</a></p>\n<p>For help finding the perfect image, Docker Hub has your back.</p>\n<p><a href=\"https://hub.docker.com/\">https://hub.docker.com/</a></p>\n<p>For index of everything Docker checkout Awesome Docker:</p>\n<p><a href=\"https://veggiemonk.github.io/awesome-docker/\">https://veggiemonk.github.io/awesome-docker/</a></p>\n","author":"eric","layout":"post","title":"Preparing for Docker","image":"/img/posts/shipping-containers.jpg","credit":"olafpictures","date":"2017-01-13","excerpt":"<p>It is a dark winter day at your desk in Maine and your boss gets back from sunny California and says \"Docker is the best, we need to start using this for everything!\". You internally groan because you just got all the infrastructure working correctly, but you start frantically searching how to setup and run Docker and jump right into figuring out how to apply it to your current projects because it needs to be done yesterday.</p>\n<p>Before looking into how to setup Docker, let's fill in the basics of what you always wanted to know about Docker but didn't know you needed to ask.</p>\n<h2>What is Docker?</h2>\n<p>Docker is a tool for developing applications in a virtualized operating system, called a container, which can run on any hardware, guaranteeing that the software runs the same in any environment.</p>\n<p>Docker containers allow you to install anything that would normally be installed on a server to run your application into a portable file that can be moved from environment to environment without any need to reinstall the dependencies</p>\n"}},"__N_SSG":true}