{"pageProps":{"postData":{"id":"caring-for-the-grindstone","href":{"pathname":"/blog/[year]/[month]/[day]/[slug]","query":{"year":"2016","month":"05","day":"05","slug":"caring-for-the-grindstone"}},"contentHtml":"<p>If I&#39;m completely honest, I never meant to become a job creator (that&#39;s what we call ourselves, it was in the pamphlet). I&#39;ve had a lot of career aspirations in my life: writer, designer, cowboy; whatever it was, they&#39;ve all come with some kind of shape: some way to describe the job in a social setting that resonates with others.</p>\n<p>Over the last two years, I&#39;ve lost that luxury.</p>\n<p>I like to tell people that my career in software started when I was 11. My grandmother needed a website for her accounting business, and I said (foolishly), &quot;I can do that.&quot; The same thing happened again when I was a marketing intern at the now-defunct Genius.com; I opened my mouth and found myself responsible for building a new corporate website. Things just got worse from there.</p>\n<p>Whatever my formal training, I wound up as a part of engineering, with all the scrums, sprints, stand-ups, and unit tests that come with. What&#39;s more, I enjoyed the work. I found that in the day-to-day tasks of architecting systems and writing code, I was stretching the same mental muscles that give me pleasure in solving crosswords and reading mysteries. The exercise of simplifying and expressing complex systems in concrete models was exciting, and new, and engaging, and three years in, I thought that starting Apsis was a way to take the best parts of that experience, and do away with the monotony and headache of legacy code and never-ending feature-releases.</p>\n<p>For me, the idea of freelance work (at it&#39;s core, that&#39;s really what we do), meant a lot more greenfield projects, more chances to experiment with new technologies, and more opportunity to define project goals and execute them in a sensible and straightforward way. In some ways I was right, but in a lot more ways, I was completely wrong.</p>\n<p>Fast forward to today, and I find that I spend a lot less of my time in front of my terminal and editor, and a lot more time as middle management. Our number one employee wrote eloquently about our responsibility to respect our client&#39;s time. What I&#39;ve found as this little experiment has grown beyond Noah, myself, and his basement, is that it&#39;s equally important for us to respect our own time.</p>\n<p>What I mean is this: for every profession I&#39;ve had or dreamed of having, there has been some piece of it I found compelling. There was some essential part of the work that drew me back to the grindstone: some reason to put on pants beyond a paycheck. As much as we make flexibility and sustainability part of the core work experience at Apsis, that same lack of formal structure means that (like much of the modern world), our workdays lose their shape, and stretch far beyond yesterday&#39;s tradition of 9 to 5. It&#39;s easier than ever to work longer than we should, and more often than not, on tasks around our work rather than the work itself. Responding to an email at 10pm on a Tuesday is work, but it is far from fulfilling, and it&#39;s certainly not what I signed up for.</p>\n<p>Now I don&#39;t imagine that these other responsibilities are not an important part of my job, and I won&#39;t pretend that that there&#39;s any sort of work that I would find refreshing every single day. But what I do know is that just as we encourage everyone in the company to think about a work-life balance, it&#39;s just as important that we think about, and try to find a balance in the work itself. If we earnestly want what we do -- whether it&#39;s software or soft shoe -- to be a career worth pursuing, we must endeavor to spend time doing what we love.</p>\n<p>To that end, as part of this third year at Apsis, I&#39;ve made it one of my personal goals -- one of my obligations -- to spend some time every day writing new code. Not debugging, not reviewing, but building. If nothing else, it&#39;s worth waking up for.</p>\n","layout":"post","author":"wyatt","title":"Caring for the Grindstone","image":"/img/posts/office.jpg","credit":"Vladimir Kudinov","date":"2016-05-05","excerpt":"<p>If I&#39;m completely honest, I never meant to become a job creator (that&#39;s what we call ourselves, it was in the pamphlet). I&#39;ve had a lot of career aspirations in my life: writer, designer, cowboy; whatever it was, they&#39;ve all come with some kind of shape: some way to describe the job in a social setting that resonates with others.</p>\n<p>Over the last two years, I&#39;ve lost that luxury.</p>\n<p>I like to tell people that my career in software started when I was 11. My grandmother needed a website for her accounting business, and I said (foolishly), &quot;I can do that</p>\n"}},"__N_SSG":true}