{"pageProps":{"postData":{"id":"work-sustainably","href":{"pathname":"/blog/[year]/[month]/[day]/[slug]","query":{"year":"2015","month":"04","day":"23","slug":"work-sustainably"}},"contentHtml":"<p>When we started Apsis Labs we never found it necessary to separate our values as founders from the values of the company. We did what felt right, and the company was an extension of ourselves. Its values were our values, and that worked for us. In our first year we tackled the usual early-stage problems: find clients, make them happy, get repeat customers, and build a reputation.</p>\n<p>...And then we sent the e-mail: \"Please find attached our official offer of employment.\"<sup><a href=\"#user-content-fn-1\" id=\"user-content-user-content-fnref-1\" aria-describedby=\"footnote-label\">1</a></sup></p>\n<p>We could no longer ignore the fact that we were a growing collection of people, each with our own thoughts, opinions, priorities, and values. Today we have real responsibilities attached to this company: clients depend on us to make their customers happy, and employees rely on us to grow their careers and make them successful.</p>\n<p>That kind of responsibility forced us, as founders, to sit down and examine the beliefs we held. Which of those varied ideas, opinions, and goals should be a core part of <em>this</em> company. Five months since we sent that first offer of employment, we figured it would be a good time to share our first Core Value: <strong>work sustainably</strong>.</p>\n<h3>Don't Work Too Much</h3>\n<p>Our employees should be happy and stress-free; work should be integrated into their lives in a <em>healthy</em> and <em>sustainable</em> fashion, and it certainly shouldn't be the center of their life.</p>\n<p>To that effect we want to put an end to the forty hour work-week. The modern work-week took hold when Henry Ford famously switched to eight hour shifts at his factory. While it was a progressive move at the time, we don't think software development in 2015 needs to match the schedule of automobile manufacturers in 1915.</p>\n<p>We ask our employees to do 20 hours of client-billable time. Beyond that, their time is their own. If they want to work on cool programming side-projects? That's awesome! Would they like to spend more time with their kids? Great! Is it time for them to pick up a new hobby — like photography or kayaking? Awesome, can we come?</p>\n<p>This goal is entirely about keeping work <em>sustainable</em>, and <em>healthy</em> for our employees. So please <strong>don't work too much</strong>.</p>\n<h3>Work From Anywhere</h3>\n<p>Where to live is a huge personal decision; it affects every aspect of your life. We, as founders, don't want you to make that choice solely based on where our office happens to be located. As an employee, you should find the place that works best for you and your family. Find somewhere with an <em>amazing</em> public school, or maybe a city with a better night-life? Live there. We'll meet you on the internet.</p>\n<p>It's also a selfish choice for us. Now we can look world-wide for software development talent without demanding that people be willing to move to sunny Seattle. 37signals has written the book on how to live and work in the 21st century with remote workers. If you want more on the remote-worker philosophy check out their book <a href=\"http://37signals.com/remote/\"><em>Remote: Office Not Required</em></a></p>\n<h3>Take Vacations</h3>\n<p>So, you've picked the perfect city to live in. You're working twenty-hours a week, so you aren't feeling particularly burnt-out. Maybe you don't <em>need</em> a vacation?</p>\n<p>Too bad, you have to take one. We firmly believe that people need some opportunities to <em>completely</em> escape their responsibilities once in a while. We really like the sound of unlimited vacation policies, but we've seen some of their downsides. Fortunately, Travis CI stepped up and solved this problem for us: <a href=\"http://www.paperplanes.de/2014/12/10/from-open-to-minimum-vacation-policy.html\">Minimum vacation policies</a>. We really like the idea, and we're going to implement it.</p>\n<p>Employees can take as much vacation as they need, with the requirement that they take <em>at least</em> 3 weeks off a year. That's an absolute minimum, and we'll revoke VPN access to enforce it if we have to.<sup><a href=\"#user-content-fn-2\" id=\"user-content-user-content-fnref-2\" aria-describedby=\"footnote-label\">2</a></sup></p>\n<hr>\n<h2 id=\"user-content-footnote-label\">Footnotes</h2>\n<ol>\n<li id=\"user-content-user-content-fn-1\">\n<p>Hiring your first employee is a really terrifying action. There's a whole new weight of responsibility that you suddenly bear on your shoulders. Now it really feels like we're playing for keeps. <a href=\"#user-content-fnref-1\" aria-label=\"Back to content\">↩</a></p>\n</li>\n<li id=\"user-content-user-content-fn-2\">\n<p>We might need to setup a VPN first. <a href=\"#user-content-fnref-2\" aria-label=\"Back to content\">↩</a></p>\n</li>\n</ol>\n","layout":"post","author":"noah","title":"Work Sustainably","image":"/img/posts/jack-straw-office.jpg","date":"2015-04-23","excerpt":"<p>When we started Apsis Labs we never found it necessary to separate our values as founders from the values of the company. We did what felt right, and the company was an extension of ourselves. Its values were our values, and that worked for us. In our first year we tackled the usual early-stage problems: find clients, make them happy, get repeat customers, and build a reputation.</p>\n"}},"__N_SSG":true}